       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE.
       AUTHOR. COBOL-PY.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       REPLACE ==:COUNT:== BY ==WS-COUNT==.
       01 :COUNT: PIC 9(4) VALUE 0.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE :COUNT: TO :COUNT:.
           EXEC SQL
             SELECT COL INTO :WS-COUNT FROM TBL WHERE K = 1
           END-EXEC.
           DISPLAY WS-COUNT.
           STOP RUN.
