       IDENTIFICATION DIVISION.
       PROGRAM-ID. COPYTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-COUNT PIC 9(4) VALUE 0.
       COPY MYCOPY.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE WS-COPY TO WS-COUNT.
           DISPLAY WS-COUNT.
           STOP RUN.
