       IDENTIFICATION DIVISION.
       PROGRAM-ID. SQLTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-COUNT PIC 9(4) VALUE 0.
       PROCEDURE DIVISION.
       MAIN-PARA.
           EXEC SQL
             SELECT COL INTO :WS-COUNT FROM TBL WHERE K = 1
           END-EXEC.
           DISPLAY WS-COUNT.
           STOP RUN.
