       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       AUTHOR. COBOL-PY.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY "Hello World".
           STOP RUN.
