       IDENTIFICATION DIVISION.
       PROGRAM-ID. REPLTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       REPLACE ==PAYROLL== BY ==SALARY==.
       01 PAYROLL PIC 9(4) VALUE 0.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE PAYROLL TO PAYROLL.
           DISPLAY PAYROLL.
           STOP RUN.
